export type tGroup = {
  "id": number;
  "Группа": string;
  "Минимальная продолжительность": number;
  "Средняя продолжительность": number;
  "Максимальная продолжительность": number;
}[];
// --------------------------------------------------------------------------------
// Вместо `export const countries: t"Группа" = getCountryStats();`
export const countries: tGroup = [
  {
    "id": 1,
    "Группа": "au",
    "Минимальная продолжительность": 20,
    "Средняя продолжительность": 427,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 2,
    "Группа": "ca",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 5283,
    "Максимальная продолжительность": 432000
  },
  {
    "id": 3,
    "Группа": "de",
    "Минимальная продолжительность": 120,
    "Средняя продолжительность": 810,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 4,
    "Группа": "gb",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1359535,
    "Максимальная продолжительность": 97836000
  },
  {
    "id": 5,
    "Группа": "nope",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1484,
    "Максимальная продолжительность": 3600
  },
  {
    "id": 6,
    "Группа": "russia",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 7,
    "Группа": "us",
    "Минимальная продолжительность": 2,
    "Средняя продолжительность": 262,
    "Максимальная продолжительность": 437070
  },
  {
    "id": 8,
    "Группа": "(empty)",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 9,
    "Группа": "au",
    "Минимальная продолжительность": 20,
    "Средняя продолжительность": 427,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 10,
    "Группа": "ca",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 5283,
    "Максимальная продолжительность": 432000
  },
  {
    "id": 11,
    "Группа": "de",
    "Минимальная продолжительность": 120,
    "Средняя продолжительность": 810,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 12,
    "Группа": "gb",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1359535,
    "Максимальная продолжительность": 97836000
  },
  {
    "id": 13,
    "Группа": "nope",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1484,
    "Максимальная продолжительность": 3600
  },
  {
    "id": 14,
    "Группа": "russia",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 15,
    "Группа": "us",
    "Минимальная продолжительность": 2,
    "Средняя продолжительность": 262,
    "Максимальная продолжительность": 437070
  },
  {
    "id": 16,
    "Группа": "(empty)",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 17,
    "Группа": "au",
    "Минимальная продолжительность": 20,
    "Средняя продолжительность": 427,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 18,
    "Группа": "ca",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 5283,
    "Максимальная продолжительность": 432000
  },
  {
    "id": 19,
    "Группа": "de",
    "Минимальная продолжительность": 120,
    "Средняя продолжительность": 810,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 20,
    "Группа": "gb",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1359535,
    "Максимальная продолжительность": 97836000
  },
  {
    "id": 21,
    "Группа": "nope",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1484,
    "Максимальная продолжительность": 3600
  },
  {
    "id": 22,
    "Группа": "russia",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 23,
    "Группа": "us",
    "Минимальная продолжительность": 2,
    "Средняя продолжительность": 262,
    "Максимальная продолжительность": 437070
  },
  {
    "id": 24,
    "Группа": "(empty)",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  },
  {
    "id": 25,
    "Группа": "au",
    "Минимальная продолжительность": 20,
    "Средняя продолжительность": 427,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 26,
    "Группа": "ca",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 5283,
    "Максимальная продолжительность": 432000
  },
  {
    "id": 27,
    "Группа": "de",
    "Минимальная продолжительность": 120,
    "Средняя продолжительность": 810,
    "Максимальная продолжительность": 1500
  },
  {
    "id": 28,
    "Группа": "gb",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1359535,
    "Максимальная продолжительность": 97836000
  },
  {
    "id": 29,
    "Группа": "nope",
    "Минимальная продолжительность": 1,
    "Средняя продолжительность": 1484,
    "Максимальная продолжительность": 3600
  },
  {
    "id": 30,
    "Группа": "russia",
    "Минимальная продолжительность": 30,
    "Средняя продолжительность": 30,
    "Максимальная продолжительность": 30
  }
];

export const states: tGroup = [
  {    "id": 1,    "Группа": "ab",    "Минимальная продолжительность": 270,    "Средняя продолжительность": 270,    "Максимальная продолжительность": 270  },
  {    "id": 2,    "Группа": "al",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 3,    "Группа": "ar",    "Минимальная продолжительность": 5,    "Средняя продолжительность": 5,    "Максимальная продолжительность": 5  },
  {    "id": 4,    "Группа": "az",    "Минимальная продолжительность": 2,    "Средняя продолжительность": 691,    "Максимальная продолжительность": 432000  },
  {    "id": 5,    "Группа": "ca",    "Минимальная продолжительность": 1,    "Средняя продолжительность": 260,    "Максимальная продолжительность": 97836000  },
  {    "id": 6,    "Группа": "co",    "Минимальная продолжительность": 2,    "Средняя продолжительность": 297,    "Максимальная продолжительность": 3600  },
  {    "id": 7,    "Группа": "ct",    "Минимальная продолжительность": 15,    "Средняя продолжительность": 795,    "Максимальная продолжительность": 1800  },
  {    "id": 8,    "Группа": "de",    "Минимальная продолжительность": 240,    "Средняя продолжительность": 1410,    "Максимальная продолжительность": 3600  },
  {    "id": 9,    "Группа": "fl",    "Минимальная продолжительность": 30,    "Средняя продолжительность": 513,    "Максимальная продолжительность": 3600  },
  {    "id": 10,    "Группа": "ga",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 360,    "Максимальная продолжительность": 600  },
  {    "id": 11,    "Группа": "hi",    "Минимальная продолжительность": 900,    "Средняя продолжительность": 900,    "Максимальная продолжительность": 900  },
  {    "id": 12,    "Группа": "ia",    "Минимальная продолжительность": 240,    "Средняя продолжительность": 360,    "Максимальная продолжительность": 600  },
  {    "id": 13,    "Группа": "id",    "Минимальная продолжительность": 3,    "Средняя продолжительность": 3,    "Максимальная продолжительность": 3  },
  {    "id": 14,    "Группа": "il",    "Минимальная продолжительность": 8,    "Средняя продолжительность": 8,    "Максимальная продолжительность": 8  },
  {    "id": 15,    "Группа": "in",    "Минимальная продолжительность": 14400,    "Средняя продолжительность": 14400,    "Максимальная продолжительность": 14400  },
  {    "id": 16,    "Группа": "ky",    "Минимальная продолжительность": 60,    "Средняя продолжительность": 150,    "Максимальная продолжительность": 300  },
  {    "id": 17,    "Группа": "ma",    "Минимальная продолжительность": 2700,    "Средняя продолжительность": 2700,    "Максимальная продолжительность": 2700  },
  {    "id": 18,    "Группа": "me",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120  },
  {    "id": 19,    "Группа": "mi",    "Минимальная продолжительность": 45,    "Средняя продолжительность": 160,    "Максимальная продолжительность": 600  },
  {    "id": 20,    "Группа": "mn",    "Минимальная продолжительность": 3600,    "Средняя продолжительность": 3600,    "Максимальная продолжительность": 3600  },
  {    "id": 21,    "Группа": "mo",    "Минимальная продолжительность": 3,    "Средняя продолжительность": 481,    "Максимальная продолжительность": 14400  },
  {    "id": 22,    "Группа": "nc",    "Минимальная продолжительность": 30,    "Средняя продолжительность": 236,    "Максимальная продолжительность": 3600  },
  {    "id": 23,    "Группа": "nd",    "Минимальная продолжительность": 2,    "Средняя продолжительность": 2,    "Максимальная продолжительность": 2  },
  {    "id": 24,    "Группа": "nh",    "Минимальная продолжительность": 300,    "Средняя продолжительность": 300,    "Максимальная продолжительность": 300  },
  {    "id": 25,    "Группа": "nv",    "Минимальная продолжительность": 2,    "Средняя продолжительность": 135,    "Максимальная продолжительность": 2700  },
  {    "id": 26,    "Группа": "ny",    "Минимальная продолжительность": 15,    "Средняя продолжительность": 368,    "Максимальная продолжительность": 1800  },
  {    "id": 27,    "Группа": "oh",    "Минимальная продолжительность": 2,    "Средняя продолжительность": 897,    "Максимальная продолжительность": 3600  },
  {    "id": 28,    "Группа": "on",    "Минимальная продолжительность": 3600,    "Средняя продолжительность": 3600,    "Максимальная продолжительность": 3600  },
  {    "id": 29,    "Группа": "pa",    "Минимальная продолжительность": 600,    "Средняя продолжительность": 600,    "Максимальная продолжительность": 600  },
  {    "id": 30,    "Группа": "tn",    "Минимальная продолжительность": 5,    "Средняя продолжительность": 393,    "Максимальная продолжительность": 1800  }
];

export const cities: tGroup = [
  {    "id": 1,    "Группа": "(empty)",    "Минимальная продолжительность": 30,    "Средняя продолжительность": 30,    "Максимальная продолжительность": 30  },
  {    "id": 2,    "Группа": "2h regiment claghorn building",    "Минимальная продолжительность": 360,    "Средняя продолжительность": 360,    "Максимальная продолжительность": 360  },
  {    "id": 3,    "Группа": "3rd company",    "Минимальная продолжительность": 10,    "Средняя продолжительность": 10,    "Максимальная продолжительность": 10  },
  {    "id": 4,    "Группа": "30th street station",    "Минимальная продолжительность": 30,    "Средняя продолжительность": 30,    "Максимальная продолжительность": 30  },
  {    "id": 5,    "Группа": "4th avenue",    "Минимальная продолжительность": 240,    "Средняя продолжительность": 240,    "Максимальная продолжительность": 240  },
  {    "id": 6,    "Группа": "40th and walnut wiring",    "Минимальная продолжительность": 300,    "Средняя продолжительность": 300,    "Максимальная продолжительность": 300  },
  {    "id": 7,    "Группа": "50th west marker st & broadway",    "Минимальная продолжительность": 900,    "Средняя продолжительность": 900,    "Максимальная продолжительность": 900  },
  {    "id": 8,    "Группа": "60th and central av",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 9,    "Группа": "78th st housetrack yond 27th",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 10,    "Группа": "abilene",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 11,    "Группа": "abingdon",    "Минимальная продолжительность": 600,    "Средняя продолжительность": 600,    "Максимальная продолжительность": 600  },
  {    "id": 12,    "Группа": "absecon",    "Минимальная продолжительность": 10,    "Средняя продолжительность": 10,    "Максимальная продолжительность": 10  },
  {    "id": 13,    "Группа": "accokeek",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120},
  {    "id": 14,    "Группа": "adelaide (pt. wakefield) (south australia)",    "Минимальная продолжительность": 600,    "Средняя продолжительность": 600,    "Максимальная продолжительность": 600  },
  {    "id": 15,    "Группа": "adelanto",    "Минимальная продолжительность": 90,    "Средняя продолжительность": 90,    "Максимальная продолжительность": 90  },
  {    "id": 16,    "Группа": "adelaide",    "Минимальная продолжительность": 90,    "Средняя продолжительность": 90,    "Максимальная продолжительность": 90  },
  {    "id": 17,    "Группа": "adrian",    "Минимальная продолжительность": 360,    "Средняя продолжительность": 360,    "Максимальная продолжительность": 36      },
  {    "id": 18,    "Группа": "aiken",    "Минимальная продолжительность": 20,    "Средняя продолжительность": 20,    "Максимальная продолжительность": 20  },
  {    "id": 19,    "Группа": "akron",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120  },
  {    "id": 20,    "Группа": "albuquerque",    "Минимальная продолжительность": 60,    "Средняя продолжительность": 60,    "Максимальная продолжительность": 60  },
  {    "id": 21,    "Группа": "alexandria",    "Минимальная продолжительность": 20,    "Средняя продолжительность": 20,    "Максимальная продолжительность": 20  },
  {    "id": 22,    "Группа": "allen park",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120  },
  {    "id": 23,    "Группа": "allendale",    "Минимальная продолжительность": 600,    "Средняя продолжительность": 600,    "Максимальная продолжительность": 600  },
  {    "id": 24,    "Группа": "alpharetta",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 25,    "Группа": "altoona",    "Минимальная продолжительность": 180,    "Средняя продолжительность": 180,    "Максимальная продолжительность": 180  },
  {    "id": 26,    "Группа": "alva",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120  },
  {    "id": 27,    "Группа": "albuquerque",    "Минимальная продолжительность": 60,    "Средняя продолжительность": 60,    "Максимальная продолжительность": 60  },
  {    "id": 28,    "Группа": "amarillo",    "Минимальная продолжительность": 300,    "Средняя продолжительность": 300,    "Максимальная продолжительность": 300  },
  {    "id": 29,    "Группа": "americus",    "Минимальная продолжительность": 120,    "Средняя продолжительность": 120,    "Максимальная продолжительность": 120  },
  {    "id": 30,    "Группа": "amherst",    "Минимальная продолжительность": 60,    "Средняя продолжительность": 60,    "Максимальная продолжительность": 60  }
];
